source/_static/diagrams/04-the-robot.d2
direction: right
n0: "robot path"
n1: "easyconfig"
n2: "easyblock"
n3: "deps"
n0 -> n1
n1 -> n2
n2 -> n3
